src/cf/Enums/ТипыПолитикУказанияСерий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ТипыПолитикУказанияСерий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СправочноеУказаниеСерий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвторасчетПоFEFOОстатковСерий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеПоFEFOОстаткамиСерий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеОстаткамиСерий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УчетСебестоимостиПоСериям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркировкаПродукцииДляГИСМ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ТипыПолитикУказанияСерий/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьОрдерныеСклады") Тогда
		
		СтандартнаяОбработка = Ложь;
		//ограничим выбор значений только используемыми
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(Перечисления.ТипыПолитикУказанияСерий.СправочноеУказаниеСерий);
		ДанныеВыбора.Добавить(Перечисления.ТипыПолитикУказанияСерий.АвторасчетПоFEFOОстатковСерий);
		ДанныеВыбора.Добавить(Перечисления.ТипыПолитикУказанияСерий.УправлениеПоFEFOОстаткамиСерий);
		ДанныеВыбора.Добавить(Перечисления.ТипыПолитикУказанияСерий.УправлениеОстаткамиСерий);
		ДанныеВыбора.Добавить(Перечисления.ТипыПолитикУказанияСерий.УчетСебестоимостиПоСериям);
		
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(Перечисления.ТипыПолитикУказанияСерий.СправочноеУказаниеСерий);
	
КонецПроцедуры

#КонецОбласти
